Revit 2027 API
RoutingPreferenceManager.PreferredJunctionType Property
 The preferred junction type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PreferredJunctionType PreferredJunctionType { get; set; }
Public Property PreferredJunctionType As PreferredJunctionType
	Get
	Set
public:
property PreferredJunctionType PreferredJunctionType {
	PreferredJunctionType get ();
	void set (PreferredJunctionType value);
}
member PreferredJunctionType : PreferredJunctionType with get, set
Property Value
PreferredJunctionType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace